app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    @post = Post.new(content: params[:content])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "やっと寝れる"], ["created_at", "2024-02-04 15:13:54.892958"], ["updated_at", "2024-02-04 15:13:54.892958"]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "やっとポートフォリオできた。"], ["updated_at", "2024-02-05 03:31:21.589077"], ["id", 6]]

  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]